# среднее время, которое было потрачено на симуляцию каждого слайса
import matplotlib.pyplot as plot

x = [a for a in range(1, 21)]
res = [182.8537459373474, 197.2622478008270, 194.3430242538452, 204.2936403751373, 214.9448585510254,
       223.2014584541320, 186.3938763141632, 177.4842734336853, 179.3945426940918, 184.6497403721384,
       192.3752840889776, 171.9387652413040, 165.9276548130562, 172.2746923762021, 150.2764002918746,
       151.2975020257345, 142.0736625341135, 145.9374014538934, 146.3938763141632, 140.83896708488464]

fig, ax = plot.subplots()
plot.xlabel('Количество заданных виртуальных пластов')
plot.ylabel('Среднее время симуляции работы сети, (с)')
ax.plot(x, res, c='green', linestyle=':', marker='.', markersize=10)
# ax.legend(loc='best')
plot.savefig('simulation_time_graf.png', dpi=300, bbox_inches='tight')
plot.show()
